/*
 * utf8.h
 *
 *  Created on: 2025年4月14日
 *      Author: 20483
 */

#ifndef CODE_UTF8_H_
#define CODE_UTF8_H_

//===================================================类型定义BEG===================================================
typedef struct
{
    const char *fuzzyStr;   // 模糊匹配字符串，可能是识别结果中的关键词
    int8 flag;              // 对应动作标志位
} FuzzyCommand;
//===================================================类型定义END===================================================


//===================================================全局变量BEG===================================================
extern char   Dictation_Result[1024];                          // 语音听写结果
extern FuzzyCommand fuzzyTable[];
//===================================================全局变量END===================================================


//===================================================函数声明BEG===================================================
void Recognize_Command(void);                                  // 识别语音听写返回的命令
void process_string(const char *str);                          // 在屏幕上显示命令
void set_dictation_result(void);                               // 设置Dictation_Result
//===================================================函数声明END===================================================



#endif /* CODE_UTF8_H_ */
  